Tekla Open API Reference for Tekla Structures 2025
AnalysisModelIssue.AnalysisObjects Property
 Gets or sets the analysis objects of the issue
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<AnalysisObject> AnalysisObjects { get; set; }
Public Property AnalysisObjects As List(Of AnalysisObject)
	Get
	Set
Property Value
Type: List<AnalysisObject>
See Also
Reference
AnalysisModelIssue Class
Tekla.Structures.Analysis Namespace